# Задание №3
# 📌 Улучшаем задачу 2.
# 📌 Добавьте возможность запуска функции “угадайки” из модуля в
# командной строке терминала.
# 📌 Строка должна принимать от 1 до 3 аргументов: параметры вызова
# функции.
# 📌 Для преобразования строковых аргументов командной строки в
# числовые параметры используйте генераторное выражение.

from task_2 import func_guess_num
from sys import argv

# print(f'{func_guess_num(14, 21, 5) = }')

if len(argv) == 4:  # Проверяем, что доступно достаточно аргументов (имя скрипта в argv[0])
    low_bound = int(argv[1])
    upper_bound = int(argv[2])
    attempts = int(argv[3])
    result = func_guess_num(low_bound, upper_bound, attempts)
    print(f'{result = }')
else:
    print("Недостаточно аргументов. Предполагаемый формат: "
          "python script.py <нижняя_граница> <верхняя_граница> <попытки>")

# python task_3.py 14 21 5