# При необходимости разработчик модуля может явно указать какие
# объекты нужно импортировать при использовании стиля from module
# import *. Для этого используется магическая переменная __all__
# (два нижних подчёркивания до, слово all и два нижних подчёркивания после).
# Изменим код модуля task_import_4.py, добавив строку с __all__.

from random import randint

__all__ = ['func', '_secret']

SIZE = 100
_secret = 'qwerty'
__top_secret = '1q2w3e4r5t6y'

def func(a: int, b: int) -> str:
    z = f'В диапазоне от {a} до {b} получили {randint(a, b)}'
    return z
result = func(1, 6)
print(result)

# Переменной __all__ присваивается список имён объектов, заключённых в
# кавычки, т.е.str типа. В основной модуль попадут только указанные в
# списке имена, независимо от того являются они публичными, защищёнными
# или приватными. При этом объект должен быть глобальным. Если указать в
# списке имя локального объекта, например переменную z — локальную переменную
# функции func, получим ошибку.