import sys


print(sys)
print(sys.builtin_module_names)
print(*sys.path, sep='\n')

# Импортировали модуль sys из стандартной библиотеки Python. Механизм импорта выполняет поиск указанного
# имени (в нашем примере — “sys”) в нескольких местах. В первую очередь проверяется список встроенных модулей,
# который хранится в sys.builtin_module_names. Если имя модуля не найдено, проверка ведётся в каталогах файловой
# системы, которые перечислены в sys.path.

# В результате импорта имя sys было добавлено в текущую, глобальную область видимости.
# Для того чтобы получить доступ к переменным, функциям, классам и т.п.содержимому модуля
# используется точечная нотация: имя_модуля<точка>имя_объекта.
# Обратиться к объекту внутри модуля напрямую при “обычном” импорте не получится. Подобный
# подход защищает от конфликта имён. Если и в вашем файле и в импортируемом модуле есть функция
# func(), конфликта имён не будет. Свою функцию вызываете как func(), а функцию из модуля как
# module_name.func()

# Содержимое переменной sys.path формируется динамически. В качестве первого адреса указывается
# путь до основного файла. Например, если вы используете Unix подобную ОС и ваш скрипт расположен
# по адресу /home/user/project, именно этот путь будет первым в списке поиска модулей.