# Множественное декорирование

# Python позволяет использовать несколько декораторов на одной функции.
# Рассмотрим на простом примере.

from typing import Callable

def deco_a(func: Callable):
    def wrapper_a(*args, **kwargs):
        print('Старт декоратора A')
        print(f'Запускаю {func.__name__}')
        res = func(*args, **kwargs)
        print(f'Завершение декоратора A')
        return res

    print('Возвращаем декоратор A')
    return wrapper_a

def deco_b(func: Callable):
    def wrapper_b(*args, **kwargs):
        print('Старт декоратора B')
        print(f'Запускаю {func.__name__}')
        res = func(*args, **kwargs)
        print(f'Завершение декоратора B')
        return res

    print('Возвращаем декоратор B')
    return wrapper_b

def deco_c(func: Callable):
    def wrapper_c(*args, **kwargs):
        print('Старт декоратора C')
        print(f'Запускаю {func.__name__}')
        res = func(*args, **kwargs)
        print(f'Завершение декоратора C')
        return res

    print('Возвращаем декоратор C')
    return wrapper_c

@deco_c
@deco_b
@deco_a
def main():
    print('Старт основной функции')

if __name__ == '__main__':
    print('>>> Запуск main()')
    main()
    print('>>> Завершение main()')

# Мы создали три одинаковых декоратора, которые сообщают о начале и
# завершении работы и о моменте декорирования: A, B, C.
# Обратите внимание на порядок декораторов у функции main. Ближайший к
# функции декоратор A. Декоратор С находится первым в списке, т.е.он
# максимально удалён от основной функции.
# При запуске кода процесс декорирования начинает снизу вверх, с A, далее
# B и лишь потом C.
# Прежде чем выполнить код основной функции запускается код верхнего
# декоратора С, далее B, в конце нижний A и только потом код функции main.
# После того как декорированная функция завершила работу и вернула
# результат декораторы завершают работу в обратном старту порядке, снизу
# вверх. В зависимости от решаемых задач порядок декорирования может
# привести к разным результатам.
# ******************************************
# Отсутствие вывода "Запускаю wrapper_c" в консоли объясняется порядком,
# в котором применяются декораторы к функции `main`. В коде,
# декораторы применяются в обратном порядке объявления к функции.
# Когда вы используете декораторы в виде `@deco_c @deco_b @deco_a`, они
# применяются к функции в следующем порядке: снизу вверх. Сначала вызывается
# `deco_a`, затем `deco_b`, и наконец `deco_c`. Каждый декоратор оборачивает
# предыдущий результат.
# Поэтому, когда функция `main` запускается после применения всех декораторов,
# она фактически равняется `deco_c(deco_b(deco_a(main)))`. Таким образом,
# `deco_c` непосредственно обертывает результат `deco_b`, который в свою
# очередь обертывает результат `deco_a`, но не прямо саму функцию `main`.
# В результате отсутствует вывод "Запускаю wrapper_c", потому что функция
# `main` уже передана в `wrapper_a` и `wrapper_b` в момент применения
# декораторов. Порядок применения декораторов влияет на структуру
# обертывания функции. Если бы вы поменяли порядок декораторов на
# `@deco_a @deco_b @deco_c`, тогда вывод "Запускаю wrapper_c" появился бы
# в консоли.