# Задание
# Напишите небольшую программу, которая запрашивает у пользователя текст.
# Если текст можно привести к целому числу, выведите его двоичное, восьмиричное
# и шестнадцатиричное представление. А если преобразование к целому невозможно,
# сообщите написан ли текст в ASCII или нет.

txt = input("Введите текст: ")
if txt.isdigit():
    print(hex(int(txt)), oct(int(txt)), bin(int(txt)))
else:
    print(txt.isascii())