# Задание
# Напишите небольшую программу, которая запрашивает у пользователя
# любой текст и выводит о нём следующую информацию:
# ● тип объекта,
# ● адрес объекта в оперативной памяти,
# ● хеш объекта.

any_txt = input("Введите любой текст: ")
print(type(any_txt))
print(id(any_txt))
print(hash(any_txt))