# Функция isinstance()
# Для проверки типа объекта используется функция isinstance().
# isinstance(object, classinfo)
# Функция принимает на вход объект и класс и возвращает истину,
# если объект является экземпляром прямого или косвенного подкласса.

data = 42
print(isinstance(data, int))

data = True
print(isinstance(data, int))

data = 3.14
print(isinstance(data, (int, float, complex)))

# 🔥 Важно! Для проверки типа можно вызывать функцию type() и сравнить значение с результатом.
# Но документация к языку не рекомендует так делать.
# Для получения информации о типе объекта правильно использовать функцию isinstance().