# Python допускает одинарные или двойные кавычки для записи строки.
# Одни кавычки могут включать другие, но они не должны смешиваться.

txt = 'Книга называется "Война и мир".'

# Тройные двойные кавычки позволяют писать текст в несколько строк.
# Если такой текст не присвоить переменной, он превращается в многострочный
# комментарий. Подобные комментарии используют для создания документации к
# коду. Например, так:

class str(object):
    """
    str(object='')-> str
    str(bytes_or_buffer[, encoding[, errors]])-> str ...
    """