# Встроенная функция help() выводит подсказку об объекте, который передается в качестве аргумента.
# Таким объектом может быть что угодно, будь то переменная, функция, класс.
# Можно сказать, что help()- более продвинутая версия dir().
# Ведь программист получает не только имена методовиатрибутов объекта, но иописание того как они работают.

# 1. Функция help() без аргументов запускает интерактивный режим.
# В нём можно указывать имена зарезервированных слов, встроенных функций,
# модулей и получать справочную информацию.
# help()
# Для выхода из режима справки используйте команду quit.
# 2. Если передать в функцию имя класса, получим подробное описание его работы.
# help(str)

import keyword
help(keyword)

# import symbol
# help(symbol)