# Модуль decimal позволяет хранить числа с плавающей запятой
# и проводить с ними математические выселения без потери точности
# и ошибок преобразования. Для этого надо воспользоваться классом
# Decimal из модуля.

import decimal

print(decimal.Decimal(0.1 + 0.2))
pi = decimal.Decimal('3.141_592_653_589_793_238_462_643_383_279_502_884_197_169_399_375')
print(pi)
num = decimal.Decimal(1) / decimal.Decimal(3)
print(num)

# Часто при работе с модулем указывают точность вычислений.
# По умолчанию она равна 28 знакам до и после запятой.
# Например, надо что-то посчитать с точностью 120 знаков:

decimal.getcontext().prec = 120
science = 2 * pi * decimal.Decimal(23.452346) ** 2
print(science)

# В первой строке кода задали точность через обращение к атрибуту prec у метода getcontext().
# Дальше считаем как обычно.