# Все числа в Python относятся к неизменяемым типам данных.
# А значит любые математические операции создают новый объект в памяти.
# Пример ниже служит подтверждением.

a = с = 2
b = 3
print(a, id(a), b, id(b), с, id(с))
a = b + с
print(a, id(a), b, id(b), с, id(с))

# Обратите внимание на первую строку кода.
# Подобное присваивание допустимо в Python.
# Переменные a и c будут указывать на один и тот же объект.
# После сложения переменная a указывает на новый объект.
# Переменная c по прежнему указывает на число 2,
# т.к. int — неизменяемый тип данных.