# Отдельный способ создания строк — конкатенация.

LIMIT = 120
ATTENTION = 'Внимание!'
name = input('Твоё имя? ')
age = int(input('Твой возраст? '))
text = ATTENTION + ' Хоть тебе и осталось ' + str(100- age) + \
       " до ста лет, но длинна строки не должна превышать " + str(LIMIT) + ' символов.'
print(text)

# Все элементы должны быть строками. Иначе получим ошибку вида: TypeError: can only concatenate str (not "int") to str.
# Именно для этого обернуты переменные с числами, такие как LIMIT, функцией str().