# Целое число имеет тип int.
# Для преобразования строки к числу используется одноименная функция.
# int(x, base=10)
# Первый аргумент — объект, который мы хотим преобразовать в число.
# Обычно это другое число и или числовая строка. Второй аргумент
# указывает на основание системы счисления. По умолчанию используется
# десятичная система, её можно не указывать. Для base допустимы значения
# от 2 до 36, т.е. от двоичной до тридцати шестиричной системы счисления.
# Примеры использования:

x = int("42")
y = int(3.1415)
z = int("hello", base=30)
print(x, y, z, sep='\n')