# В Python есть такое определение как "резиновый инт".
# При этом вы должны понимать, что любой объект хранит в себе
# "служебную информацию", которая также занимает место в памяти.
# Воспользуемся функцией getsizeof() из модуля sys, чтобы посмотреть
# на затраты памяти под целым числом.

import sys

STEP = 2 ** 16
num = 1
for _ in range(30):
    print(sys.getsizeof(num), num)
    num *= STEP

# Для хранения "единицы" в 64-х разрядной версии Python тратится 28(!) байт памяти.
# Это объект со своей служебной информацией и несколькими байтами под само число.
# При этом мы можем хранить огромные числа, превышающие long integer на много порядков
# без проблем и лишних приёмов программирования. Число Гугол, т.е. 10 в степени 100 займет
# всего лишь 72 (байта).

print(sys.getsizeof(10 ** 100))

#############

num = 7_901_123_456_789
print(num)