# Задание №7
# 📌 Пользователь вводит число от 1 до 999.
# Используя операции с числами сообщите что введено:
# цифра, двузначное число или трёхзначное число.
# 📌 Для цифры верните её квадрат, например 5 - 25.
# 📌 Для двузначного числа произведение цифр, например 30 - 0.
# 📌 Для трёхзначного числа его зеркальное отображение, например 520 - 25.
# 📌 Если число не из диапазона, запросите новое число.
# 📌 Откажитесь от магических чисел.
# 📌 В коде должны быть один input и один print.


a = int(input("Введите число от 1 до 999: "))
if a >= 1 and a <= 999:
    if a < 10:
        print(a ** 2)
    elif a >= 10 and a <= 99:
        x_1 = a / 10
        x_2 = a % 10
        print(x_1 * x_2)
    elif a > 99 and a < 1000:
        x_1 = a // 100
        x_2 = (a // 10) % 10
        x_3 = a % 10
        x = x_3 * 100 + x_2 * 10 + x_1
        print(x)
else:
    print('Вы ввели число не из указанного диапазона.\n Повторите попытку.')

