# Задание №4
# 📌 Работа в консоли в режиме интерпретатора Python.
# 📌 Решите квадратное уравнение 5x^2-10x-400=0 последовательно
# сохраняя переменные a, b, c, d, x1 и x2.
# 📌 *Попробуйте решить уравнения с другими значениями a, b, c.

from math import sqrt

a = 5
b = -10
c = -400
D = (b ** 2) - (4 * a * c)
if D < 0:
    print('Корней нет')
elif D > 0:
    # x_1 = (-b + (D)**0.5) / (2*a)
    # x_2 = (-b - (D)**0.5) / (2*a)
    x_1 = (sqrt(D) - b) / (2 * a)
    x_2 = (-sqrt(D) - b) / (2 * a)
    # print('Корни квадратного выражения:', x_1, 'и', x_2)
    print(f'Корни квадратного выражения: {x_1, x_2}')
elif D == 0:
    x_1 = (-b) / (2 * a)
    print(x_1)