# Задание №7
# 📌 Создайте модуль и напишите в нём функцию, которая получает на
# вход дату в формате DD.MM.YYYY
# 📌 Функция возвращает истину, если дата может существовать или ложь,
# если такая дата невозможна.
# 📌 Для простоты договоримся, что год может быть в диапазоне [1, 9999].
# 📌 Весь период (1 января 1 года - 31 декабря 9999 года) действует
# Григорианский календарь.
# 📌 Проверку года на високосность вынести в отдельную защищённую функцию.

def func_date(data: list[str]):
    if len(data) == 3:
        # if len(data[0]) == 2 and len(data[1]) == 2 and len(data[2]) == 4:
            day, month, year = data
            if 1 <= int(day) <= 31 and 1 <= int(month) <= 12 and 1 <= int(year) <= 9999:
                return True
    else:
        return False

txt = input("Введите дату в формате ДД.ММ.ГГГГ: ").split('.')
# data = [int(val) for val in txt]
print(func_date(txt))
