text = 'однажды в СТУДЁНУЮ зИмнЮЮ ПоРУ'
print(text.upper())
print(text.lower())
print(text.title())
print(text.capitalize())

# ● upper — все символы приводятся к верхнему регистру
# ● lower — все символы приводятся к нижнему регистру
# ● title — первый символ каждого слова (разделитель слов - пробел)
# приводится к верхнему регистру, остальные символы к нижнему
# ● capitalize — первый символ строки в верхнем регистре, остальные
# в нижнем

# Метод startswith проверяет начинается ли строка с заданной подстроки.
# Метод возвращает истину или ложь. Метод endswith проверяет окончание
# строки переданной в качестве аргумента подстрокой.

text = 'Однажды в студёную зимнюю пору'
print(text.startswith('Однажды'))
print(text.endswith('зимнюю', 0, -5))

# Оба метода помимо подстроки могут принимать параметры start и stop.
# В этом случае проверка начала либо конца будет проводиться в указанном
# диапазоне.