# Задание.
# Перед вами список и несколько строк кода, которые его меняют.
# Напишите что вернёт каждая из строк кода. Попробуйте справится
# с заданием без запуска кода. У вас 3 минуты.

my_list = [2, 4, 6, 2, 8, 10, 12, 14, 16, 18]
print(my_list[2:6:2])
# 6 8
print(my_list.pop(), my_list)
# 18 [2, 4, 6, 2, 8, 10, 12, 14, 16]
print(my_list.extend([314, 42]), my_list)
# [2, 4, 6, 2, 8, 10, 12, 14, 16, 18, 314, 42]
print(my_list.sort(reverse=False), my_list)
# [2, 2, 4, 6, 8, 10, 12, 14, 16, 18, 42, 314]
print(my_list)
# [2, 2, 4, 6, 8, 10, 12, 14, 16, 18, 42, 314]