# Способы создания словаря
# Для создания словаря есть несколько способов. Например:
# ● передать набор пар ключ-значение в фигурных скобках,
# ● использовать знак равенства между ключом и значением,
# ● передать любую последовательность, каждый элемент который
# пара ключ и значение

a = {'one': 42, 'two': 3.14, 'ten': 'Hello world!'}
b = dict(one=42, two=3.14, ten='Hello world!')
c = dict([('one', 42), ('two', 3.14), ('ten', 'Hello world!')])
print(a == b == c)

# Важно! Вариант b не допускает использования зарезервированных слов.
# При этом ключи указываются без кавычек, но в словаре становятся
# ключами типа str.

# Для добавления в существующий словарь новой пары ключ-значение
# можно использовать обычную операцию присваивания.

my_dict = {'one': 1, 'two': 2, 'three': 3, 'four': 4}
my_dict['ten'] = 10
print(my_dict)

# Для получения доступа к значению необходимо указать ключ в
# квадратных скобках после или переменной.

TEN = 'ten'
my_dict = {'one': 1, 'two': 2, 'three': 3, 'four': 4, 'ten': 10}
print(my_dict['two'])
print(my_dict[TEN])
# print(my_dict[1]) # KeyError: 1

# Ключ может быть указан явно или передан как содержимое переменной,
# константы. При попытке обратиться к несуществующему ключу получаем
# ошибку: KeyError.
# Доступ к ключу позволяет изменять значения. Для этого используем
# операцию присваивания, как и в случае с добавлением новой пары
# ключ - значение.

# Важно! Получить доступ к ключу по значению невозможно.