# Задание №1.
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a_int = 33
a_str = 'name'
a_float = 3.15
print(type(a_int), type(a_str), type(a_float))