# ● Сериализация — это процесс преобразования объекта в поток байтов
# для сохранения или передачи в память, базу данных или файл.
# ● Десериализация — восстановление объектов из байт, сохранение
# которых было произведено ранее. Процедура выгрузки «зафиксированной»
# информации пользователем.

# 1. JSON.
# JSON (JavaScript Object Notation) — это популярный формат текстовых
# данных, который используется для обмена данными в современных веб-
# и мобильных приложениях. Кроме того, JSON используется для хранения
# неструктурированных данных в файлах журналов или базах данных NoSQL.
# Несмотря на JavaScript в названии формат JSON не привязывается к
# конкретному ЯП. Созданный на Python JSON может быть прочитан
# приложением под Андроид на Java и под iPhone на Swift. Как результат
# JSON стал одним из самых популярных форматов передачи данных.

# Некоторые типы данных Python не совпадают с типами в формате JSON.
# Поэтому при конвертации словаря в JSON и последующей конвертации
# в словарь типы данных могут оказаться иными.

# Python          JSON            Python
# ***************************************
# dict            object          dict
# list, tuple     array           list
# str             string          str
# int             number (int)    int
# float           number (real)   float
# True            true            True
# False           false           False
# None            null            None


# Обратите внимание, что list и tuple конвертируется в массив array,
# а при обратной конвертации получаем только list. Если мы храним
# несколько JSON объектов, в Python обычно используют list. Для JSON
# в этом случае используется array — в квадратных скобках записываются
# JSON объекты разделённые запятыми.