# Задание.
# Перед вами несколько строк кода. Напишите что по вашему мнению
# выведет print, не запуская код.

data = {10, 9, 8, 1, 6, 3}
a, b, c, *d, e = data
print(a, b, c, d, e)
# 1 3 6 [8, 9] 10

