# Задание.
# Перед вами несколько строк кода. Напишите что выведет каждая из
# строк, не запуская код.

data = {"один": 1, "два": 2, "три": 3}
x = iter(data.items())
print(x)  # упущена звездочка для распаковки
# ("один", 1) ("два", 2) ("три", 3) <dict_itemiterator object at ****>
y = next(x)
print(y)
# ("один", 1)
z = next(iter(y))
print(z)
# один