# Задача 1.
# Нахождение наибольшего общего делителя (НОД) двух чисел.
# Программа принимает два целых числа и находит их наибольший общий делитель (НОД).

def func_nod(a: int, b: int):
    while b != 0:
        a, b = b, a % b
    return a

num_1 = int(input("Введите целое число a: "))
num_2 = int(input("Введите целое число b: "))
res = func_nod(num_1, num_2)
print(res)