# Задание №6.
# Пользователь вводит строку текста. Вывести каждое слово с новой строки.
# ✔ Строки нумеруются начиная с единицы.
# ✔ Слова выводятся отсортированными согласно кодировки Unicode.
# ✔ Текст выравнивается по правому краю так, чтобы у самого длинного слова
# был один пробел между ним и номером строки.

txt = sorted(input("Введите текст соблюдая пробелы: ").split())
max_length = max(len(word) for word in txt)
for i, elem in enumerate(txt, start=1):
    len_space = (max_length - len(elem) + 1) * ' '
    print(f'{i}{len_space}{elem}')
