# Задание №7
# ✔ Создайте функцию-генератор.
# ✔ Функция генерирует N простых чисел, начиная с числа 2.
# ✔ Для проверки числа на простоту используйте правило:
# «число является простым, если делится нацело только на единицу и на себя».

# N = int(input("введите число: "))
# a = range(2, N)
#
# [print((i * i > N) while i * i <= N and N % i != 0: i+=1]

def primes_generator(n):
    a = range(2, n)
    [print(i) for i in a if all(i % j != 0 for j in range(2, int(i**0.5)+1))]

primes_generator(n=int(input("Введите число: ")))