# Задание №6.
# ✔ Выведите в консоль таблицу умножения от 2х2 до 9х10 как на школьной тетрадке.
# ✔ Таблицу создайте в виде однострочного генератора, где каждый элемент генератора
# — отдельный пример таблицы умножения.
# ✔ Для вывода результата используйте «принт» без перехода на новую строку.


for i in range(2, 10):
    for j in range(2, 11):
        for k in [0, 4]:
            if j + k < 11:
                print(f'{i} * {j + k} = {i * (j + k)}\t', end='')
        print()

# for k in [0, 4]:
#     for i in range(2, 11):
#         res = ''
#         for j in range(2 + k, 6 + k):
#             res += f'{j:^2} x {i:^2} = {i * j:^2}\t'
#         print(res)
#     print()


[print(f'{i} * {j} = {i * j}', end='\t') if j != 10 else print(f'{i} * {j} = {i * j}') for i in range(2, 10) for j in range(2, 11)]

