# Задание №4.
# ✔ Создайте генератор чётных чисел от нуля до 100.
# ✔ Из последовательности исключите числа, сумма цифр
# которых равна 8.
# ✔ Решение в одну строку.

a = list(range(0, 101, 2))
# print(a)
res = (i for i in a if (i % 10 + i // 10) != 8)
print(*res)