# Задача 3. Простые числа.
# Напишите программу, которая считает количество простых чисел в заданной последовательности
# и выводит ответ на экран. Простое число делится только на себя и на единицу. Последовательность
# задаётся при помощи вызова ввода (input) на каждой итерации цикла. Одна итерация — одно число.

count = 0
n = int(input("Введите кол-во попыток: "))

while n > 0:
    num = int(input("Введите число: "))
    is_prime = True
    for i in range(2, int(num**0.5) + 1):
        if num % i == 0:
            is_prime = False
            break
    if num > 1 and is_prime:
        count += 1
    n -= 1
print(f'Кол-во введенных простых чисел: {count}')
