# Задание 1. Рамка
# Напишите программу, которая рисует прямоугольную рамку с
# помощью символьной графики. Для вертикальных линий используйте
# символ вертикального штриха (|), а для горизонтальных — дефис (-).
# Пусть ширину и высоту рамки определяет пользователь.

# v = int(input("Введите кол-во вертикальных штрихов (|): "))
# h = int(input("Введите кол-во горизонтальных штрихов (-): "))
# v_f = '|'
# h_f = '-'
# space = ' '
# for i in range(v):
#     print(v_f + h * h_f + v_f)
#     for j in range(2, v):
#         if i == v or i == 1:
#             print(v_f + h * space + v_f)
#     print(v_f + h * h_f + v_f)


###

v = int(input("Введите кол-во вертикальных штрихов (|): "))
h = int(input("Введите кол-во горизонтальных штрихов (-): "))
v_f = '|'
h_f = '-'
space = ' '
# for _ in range(v):
print(v_f + h * h_f + v_f)
for _ in range(v - 2):
    print(v_f + h * space + v_f)
print(v_f + h * h_f + v_f)



