# Задача 2.
# Поиск наибольшего числа в списке. Напишите программу, которая принимает
# список чисел через строку и возвращает наибольшее число в этом списке.

list_1 = input("Введите несколько чисел через пробел: ").split()
list_2 =list(list_1)
elem_max = list_2[0]
for i in list_2:
    if int(i) > int(elem_max):
        elem_max = int(i)
print(elem_max)