# Файл — это область данных на носителе информации
# (диске, флешке и т.п.). Файл используется как базовый объект
# взаимодействия с данными. Операционная система обращается к файлу
# по имени.

# В Python для получения доступа файлу используют функцию open().

# open(file, mode='r', buffering=-1, encoding=None, errors=None,
# newline=None, closefd=True, opener=None)

# Функция open имеет один обязательный параметр — file. Обычно
# file — это объект типа str или bytes, который представляет
# абсолютный или относительный путь к файлу. Относительный путь
# считается от каталога запуска программы. Функция возвращает
# файловый объект или вызывает ошибку OSError, если не получилось
# вернуть объект.

f = open('text_data.txt', 'r', encoding='utf-8')
print(f)
print(list(f))

# 🔥 Важно! Кодировка UTF-8 является современным стандартом для
# хранения и передачи текстовой информации.